cnone616/Glowxel/esp32-firmware/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <AsyncWebSocket.h>
#include <AsyncTCP.h>
#include <ArduinoJson.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <Preferences.h>
#include <DNSServer.h>
#include <time.h>

const char* ap_ssid = "LED-Matrix-Setup";
const char* ap_password = "12345678";

// NTP 时间服务器
const char* ntpServer = "pool.ntp.org";
const long gmtOffset_sec = 8 * 3600; // 中国时区 UTC+8
const int daylightOffset_sec = 0;

Preferences preferences;
String saved_ssid = "";
String saved_password = "";
bool config_mode = false;

// 设备模式
enum DeviceMode {
  MODE_CLOCK,    // 闹钟模式（默认）
  MODE_CANVAS    // 画板模式
};

DeviceMode currentMode = MODE_CLOCK;
bool clientConnected = false;

// 闹钟配置结构
struct ClockConfig {
  struct {
    int fontSize;
    int x;
    int y;
    uint8_t r;
    uint8_t g;
    uint8_t b;
  } time;
  
  struct {
    bool show;
    int fontSize;
    int x;
    int y;
    uint8_t r;
    uint8_t g;
    uint8_t b;
  } date;
  
  struct {
    bool show;
    int x;
    int y;
    uint8_t r;
    uint8_t g;
    uint8_t b;
  } week;
  
  struct {
    bool show;
    int x;
    int y;
    int width;
    int height;
  } image;
};

// 默认闹钟配置
ClockConfig clockConfig = {
  .time = {1, 17, 18, 100, 200, 255},
  .date = {true, 1, 3, 30, 120, 120, 120},
  .week = {true, 23, 44, 100, 100, 100},
  .image = {false, 0, 0, 64, 64}
};

// 图片像素数据存储（闹钟模式背景图）
struct PixelData {
  uint8_t x;
  uint8_t y;
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

PixelData* imagePixels = nullptr;
int imagePixelCount = 0;

// 画板模式像素缓冲区（64x64完整画布，RGB格式）
uint8_t canvasBuffer[64][64][3]; // [y][x][rgb]
bool canvasInitialized = false;

// 二进制数据接收状态
unsigned long lastBinaryReceiveTime = 0;
bool binaryDataPending = false;

#define PANEL_RES_X 64
#define PANEL_RES_Y 64
#define PANEL_CHAIN 1

MatrixPanel_I2S_DMA *dma_display = nullptr;
AsyncWebServer server(80);
DNSServer dnsServer;
AsyncWebSocket ws("/ws");

uint8_t* imageBuffer = nullptr;
size_t imageSize = 0;
int currentBrightness = 50; // 默认亮度50%，对应设备端约20%

// 函数声明
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len);

void setupWiFi() {
  preferences.begin("wifi", false);
  saved_ssid = preferences.getString("ssid", "");
  saved_password = preferences.getString("password", "");
  preferences.end();
  
  if (saved_ssid.length() > 0) {
    Serial.println("尝试连接到保存的WiFi: " + saved_ssid);
    WiFi.mode(WIFI_STA);
    WiFi.begin(saved_ssid.c_str(), saved_password.c_str());
    
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
      delay(500);
      Serial.print(".");
      attempts++;
    }
    
    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("\nWiFi已连接");
      Serial.print("IP地址: ");
      Serial.println(WiFi.localIP());
      config_mode = false;
      
      // 同步NTP时间
      configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
      Serial.println("正在同步网络时间...");
      
      // 在LED上显示连接成功和IP
      dma_display->clearScreen();
      dma_display->setTextSize(1);
      dma_display->setCursor(2, 2);
      dma_display->setTextColor(dma_display->color565(0, 255, 0));
      dma_display->println("WiFi OK");
      dma_display->setCursor(2, 12);
      dma_display->setTextColor(dma_display->color565(255, 255, 255));
      dma_display->println(WiFi.localIP().toString());
      
      delay(2000);
      
      // 进入闹钟模式
      currentMode = MODE_CLOCK;
      
      return;
    }
    
    Serial.println("\n连接失败，进入配置模式");
  } else {
    Serial.println("未找到WiFi配置，进入配置模式");
  }
  
  config_mode = true;
  WiFi.mode(WIFI_AP);
  
  IPAddress local_IP(192, 168, 4, 1);
  IPAddress gateway(192, 168, 4, 1);
  IPAddress subnet(255, 255, 255, 0);
  WiFi.softAPConfig(local_IP, gateway, subnet);
  
  WiFi.softAP(ap_ssid, ap_password, 1, 0, 4);
  delay(500);
  
  dnsServer.start(53, "*", WiFi.softAPIP());
  
  Serial.println("\n=================================");
  Serial.println("配置模式已启动");
  Serial.println("热点名称: " + String(ap_ssid));
  Serial.println("热点密码: " + String(ap_password));
  Serial.print("配置地址: http://");
  Serial.println(WiFi.softAPIP());
  Serial.println("DNS服务器已启动");
  Serial.println("=================================");
  
  dma_display->clearScreen();
  dma_display->setTextSize(1);
  
  dma_display->setCursor(2, 10);
  dma_display->setTextColor(dma_display->color565(0, 255, 255));
  dma_display->print("WiFi:");
  dma_display->setTextColor(dma_display->color565(255, 255, 255));
  dma_display->println(ap_ssid);
  
  dma_display->setCursor(2, 40);
  dma_display->setTextColor(dma_display->color565(0, 255, 255));
  dma_display->print("Pass:");
  dma_display->setTextColor(dma_display->color565(255, 255, 255));
  dma_display->println(ap_password);
}

void setupMatrix() {
  HUB75_I2S_CFG mxconfig(PANEL_RES_X, PANEL_RES_Y, PANEL_CHAIN);
  mxconfig.gpio.e = 18;
  mxconfig.clkphase = false;
  
  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  dma_display->begin();
  dma_display->setBrightness8(51); // 默认亮度约20% (51/255)
  dma_display->clearScreen();
  
  Serial.println("显示开机Logo...");
  
  uint16_t red = dma_display->color565(255, 100, 100);
  uint16_t orange = dma_display->color565(255, 165, 0);
  uint16_t yellow = dma_display->color565(255, 220, 0);
  uint16_t green = dma_display->color565(100, 255, 100);
  uint16_t blue = dma_display->color565(100, 150, 255);
  
  int blockSize = 8;
  int gridSize = 12;
  int startPos = 4;  // 往下2，往右2
  
  for(int row = 0; row < 5; row++) {
    dma_display->fillRect(startPos, startPos + row * gridSize, blockSize, blockSize, red);
  }
  
  dma_display->fillRect(startPos + gridSize, startPos + gridSize, blockSize, blockSize, orange);
  dma_display->fillRect(startPos + gridSize * 2, startPos + gridSize * 2, blockSize, blockSize, yellow);
  dma_display->fillRect(startPos + gridSize * 3, startPos + gridSize, blockSize, blockSize, green);
  
  for(int row = 0; row < 5; row++) {
    dma_display->fillRect(startPos + gridSize * 4, startPos + row * gridSize, blockSize, blockSize, blue);
  }
  
  delay(2000);
  Serial.println("LED灯板初始化完成");
}

void displayImage(uint8_t* data, size_t len, int width, int height) {
  dma_display->clearScreen();
  
  for (int y = 0; y < height && y < PANEL_RES_Y; y++) {
    for (int x = 0; x < width && x < PANEL_RES_X; x++) {
      int idx = (y * width + x) * 3;
      if (idx + 2 < len) {
        uint8_t r = data[idx];
        uint8_t g = data[idx + 1];
        uint8_t b = data[idx + 2];
        dma_display->drawPixelRGB888(x, y, r, g, b);
      }
    }
  }
}

// 显示时钟
void displayClock() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    // 时间未同步，显示 "--:--"
    dma_display->clearScreen();
    dma_display->setTextSize(1);
    dma_display->setCursor(17, 18);
    dma_display->setTextColor(dma_display->color565(100, 200, 255));
    dma_display->print("--:--");
    return;
  }
  
  dma_display->clearScreen();
  
  // 先绘制背景图片（如果有）
  Serial.printf("displayClock: image.show=%d, imagePixels=%p, imagePixelCount=%d\n", 
    clockConfig.image.show, imagePixels, imagePixelCount);
  
  if (clockConfig.image.show && imagePixels != nullptr && imagePixelCount > 0) {
    Serial.printf("开始绘制 %d 个像素\n", imagePixelCount);
    // 绘制所有保存的像素
    for (int i = 0; i < imagePixelCount; i++) {
      PixelData& pixel = imagePixels[i];
      if (pixel.x < PANEL_RES_X && pixel.y < PANEL_RES_Y) {
        dma_display->drawPixelRGB888(pixel.x, pixel.y, pixel.r, pixel.g, pixel.b);
      }
      // 每100个像素让出CPU
      if (i % 100 == 0) yield();
    }
    Serial.println("像素绘制完成");
  } else {
    Serial.println("不绘制像素画");
  }
  
