cnone616/Glowxel/esp32-firmware/src/main.cpp
  // 显示时间 HH:MM
  char timeStr[6];
  sprintf(timeStr, "%02d:%02d", timeinfo.tm_hour, timeinfo.tm_min);
  
  dma_display->setTextSize(clockConfig.time.fontSize);
  dma_display->setCursor(clockConfig.time.x, clockConfig.time.y);
  dma_display->setTextColor(dma_display->color565(
    clockConfig.time.r, 
    clockConfig.time.g, 
    clockConfig.time.b
  ));
  dma_display->print(timeStr);
  
  // 显示日期 MM-DD
  if (clockConfig.date.show) {
    char dateStr[6];
    sprintf(dateStr, "%02d-%02d", timeinfo.tm_mon + 1, timeinfo.tm_mday);
    
    dma_display->setTextSize(clockConfig.date.fontSize);
    dma_display->setCursor(clockConfig.date.x, clockConfig.date.y);
    dma_display->setTextColor(dma_display->color565(
      clockConfig.date.r, 
      clockConfig.date.g, 
      clockConfig.date.b
    ));
    dma_display->print(dateStr);
  }
  
  // 显示星期
  if (clockConfig.week.show) {
    const char* weekDays[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    dma_display->setTextSize(1);
    dma_display->setCursor(clockConfig.week.x, clockConfig.week.y);
    dma_display->setTextColor(dma_display->color565(
      clockConfig.week.r, 
      clockConfig.week.g, 
      clockConfig.week.b
    ));
    dma_display->print(weekDays[timeinfo.tm_wday]);
  }
}

// WebSocket 事件处理
void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len) {
  if (type == WS_EVT_CONNECT) {
    Serial.printf("WebSocket 客户端已连接: %u\n", client->id());
    clientConnected = true;
    
    // 如果当前是闹钟模式，显示时钟；否则清空屏幕
    if (currentMode == MODE_CLOCK) {
      displayClock();
    } else {
      dma_display->clearScreen();
    }
    
    // 发送连接成功消息，包含当前模式
    String response = "{\"status\":\"connected\",\"device\":\"LED-Matrix\",\"mode\":\"";
    response += (currentMode == MODE_CLOCK) ? "clock" : "canvas";
    response += "\"}";
    client->text(response);
  }
  else if (type == WS_EVT_DISCONNECT) {
    Serial.printf("WebSocket 客户端已断开: %u\n", client->id());
    clientConnected = false;
    
    // 断开连接后，回到闹钟模式
    currentMode = MODE_CLOCK;
    displayClock();
  }
  else if (type == WS_EVT_DATA) {
    AwsFrameInfo *info = (AwsFrameInfo*)arg;
    
    // 处理二进制数据
    if (info->opcode == WS_BINARY) {
      // 二进制格式：每5字节一个像素 (x, y, r, g, b)
      int pixelCount = len / 5;
      Serial.printf("收到二进制像素数据: %d bytes, %d 个像素, 当前模式: %s\n", 
        len, pixelCount, (currentMode == MODE_CLOCK) ? "clock" : "canvas");
      
      if (pixelCount > 0) {
        // 画板模式：保存到 canvasBuffer（64x64完整画布）
        if (currentMode == MODE_CANVAS) {
          Serial.println("画板模式：更新画布缓冲区");
          
          // 第一次接收时初始化画布（清空）
          if (!canvasInitialized) {
            Serial.println("初始化画布缓冲区");
            memset(canvasBuffer, 0, sizeof(canvasBuffer));
            canvasInitialized = true;
          }
          
          int validPixels = 0;
          for (size_t i = 0; i + 4 < len; i += 5) {
            uint8_t x = data[i];
            uint8_t y = data[i + 1];
            uint8_t r = data[i + 2];
            uint8_t g = data[i + 3];
            uint8_t b = data[i + 4];
            
            if (x < PANEL_RES_X && y < PANEL_RES_Y) {
              // 直接覆盖对应位置的像素
              canvasBuffer[y][x][0] = r;
              canvasBuffer[y][x][1] = g;
              canvasBuffer[y][x][2] = b;
              validPixels++;
              
              // 立即绘制
              dma_display->drawPixelRGB888(x, y, r, g, b);
            }
            
            if (i % 500 == 0) yield();
          }
          
          Serial.printf("画板模式 - 更新了 %d 个像素\n", validPixels);
          
          return;
        }
        
        // 闹钟模式：保存到 imagePixels（背景图）
        // 如果是新的一批数据（距离上次超过1秒），清空旧数据重新开始
        if (millis() - lastBinaryReceiveTime > 1000) {
          Serial.println("=== 开始接收新的像素数据，清空旧数据 ===");
          if (imagePixels != nullptr) {
            free(imagePixels);
            imagePixels = nullptr;
          }
          imagePixelCount = 0;
        }
        
        // 打印前3个像素的原始数据
        if (imagePixelCount == 0 && len >= 15) {
          Serial.println("前3个像素的原始字节:");
          for (int i = 0; i < 15; i++) {
            Serial.printf("%d ", data[i]);
          }
          Serial.println();
        }
        
        // 追加数据
        PixelData* newBuffer = (PixelData*)realloc(imagePixels, sizeof(PixelData) * (imagePixelCount + pixelCount));
        if (newBuffer != nullptr) {
          imagePixels = newBuffer;
          
          int validPixels = 0;
          // 复制像素数据
          for (size_t i = 0; i + 4 < len; i += 5) {
            uint8_t x = data[i];
            uint8_t y = data[i + 1];
            uint8_t r = data[i + 2];
            uint8_t g = data[i + 3];
            uint8_t b = data[i + 4];
            
            // 打印前3个像素
            if (imagePixelCount < 3) {
              Serial.printf("像素 #%d: x=%d, y=%d, r=%d, g=%d, b=%d\n", 
                imagePixelCount, x, y, r, g, b);
            }
            
            if (x < PANEL_RES_X && y < PANEL_RES_Y) {
              // 保存到内存
              imagePixels[imagePixelCount].x = x;
              imagePixels[imagePixelCount].y = y;
              imagePixels[imagePixelCount].r = r;
              imagePixels[imagePixelCount].g = g;
              imagePixels[imagePixelCount].b = b;
              imagePixelCount++;
              validPixels++;
              
              // 立即绘制
              dma_display->drawPixelRGB888(x, y, r, g, b);
            }
            
            // 每处理100个像素让出CPU，防止看门狗超时
            if (i % 500 == 0) {
              yield();
            }
          }
          
          Serial.printf("闹钟模式 - 本批有效像素: %d, 累计: %d\n", validPixels, imagePixelCount);
          
          // 更新接收时间，标记有待保存的数据
          lastBinaryReceiveTime = millis();
          binaryDataPending = true;
          
        } else {
          Serial.println("✗ 内存分配失败！");
        }
      }
      
      return;
    }
    
    // 处理JSON命令
    Serial.printf("收到 WebSocket 数据: %d bytes\n", len);
    
    // 解析JSON命令 - 使用动态分配以支持大图片数据
    DynamicJsonDocument doc(40960); // 40KB 缓冲区
    DeserializationError error = deserializeJson(doc, data, len);
    
    if (error) {
      Serial.print("JSON解析失败: ");
      Serial.println(error.c_str());
      client->text("{\"error\":\"invalid json\"}");
      return;
    }
    
    String cmd = doc["cmd"].as<String>();
    Serial.println("命令: " + cmd);
    
    StaticJsonDocument<512> response;
    response["status"] = "ok";
    
    if (cmd == "ping") {
      response["message"] = "pong";
    }
    else if (cmd == "status") {
      response["ip"] = WiFi.localIP().toString();
      response["width"] = PANEL_RES_X;
      response["height"] = PANEL_RES_Y;
      response["brightness"] = currentBrightness;
      response["mode"] = (currentMode == MODE_CLOCK) ? "clock" : "canvas";
    }
    else if (cmd == "set_mode") {
      String mode = doc["mode"].as<String>();
      if (mode == "clock") {
        currentMode = MODE_CLOCK;
        displayClock();
        response["message"] = "switched to clock mode";
      } else if (mode == "canvas") {
        currentMode = MODE_CANVAS;
        
