cnone616/Glowxel/esp32-firmware/src/main.cpp
        // 如果有画布缓冲区数据，恢复显示
        if (canvasInitialized) {
          Serial.println("恢复画布缓冲区数据");
          for (int y = 0; y < PANEL_RES_Y; y++) {
            for (int x = 0; x < PANEL_RES_X; x++) {
              uint8_t r = canvasBuffer[y][x][0];
              uint8_t g = canvasBuffer[y][x][1];
              uint8_t b = canvasBuffer[y][x][2];
              if (r > 0 || g > 0 || b > 0) {
                dma_display->drawPixelRGB888(x, y, r, g, b);
              }
            }
            if (y % 8 == 0) yield();
          }
        } else {
          dma_display->clearScreen();
        }
        
        response["message"] = "switched to canvas mode";
      } else {
        response["status"] = "error";
        response["message"] = "invalid mode";
      }
    }
    else if (cmd == "set_clock_config") {
      // 接收闹钟配置
      JsonObject config = doc["config"];
      
      // 时间配置
      if (config.containsKey("time")) {
        JsonObject time = config["time"];
        clockConfig.time.fontSize = time["fontSize"] | 1;
        clockConfig.time.x = time["x"] | 17;
        clockConfig.time.y = time["y"] | 18;
        JsonObject timeColor = time["color"];
        clockConfig.time.r = timeColor["r"] | 100;
        clockConfig.time.g = timeColor["g"] | 200;
        clockConfig.time.b = timeColor["b"] | 255;
      }
      
      // 日期配置
      if (config.containsKey("date")) {
        JsonObject date = config["date"];
        clockConfig.date.show = date["show"] | true;
        clockConfig.date.fontSize = date["fontSize"] | 1;
        clockConfig.date.x = date["x"] | 3;
        clockConfig.date.y = date["y"] | 30;
        JsonObject dateColor = date["color"];
        clockConfig.date.r = dateColor["r"] | 120;
        clockConfig.date.g = dateColor["g"] | 120;
        clockConfig.date.b = dateColor["b"] | 120;
      }
      
      // 星期配置
      if (config.containsKey("week")) {
        JsonObject week = config["week"];
        clockConfig.week.show = week["show"] | true;
        clockConfig.week.x = week["x"] | 23;
        clockConfig.week.y = week["y"] | 44;
        JsonObject weekColor = week["color"];
        clockConfig.week.r = weekColor["r"] | 100;
        clockConfig.week.g = weekColor["g"] | 100;
        clockConfig.week.b = weekColor["b"] | 100;
      }
      
      // 图片配置
      if (config.containsKey("image")) {
        JsonObject image = config["image"];
        clockConfig.image.show = image["show"] | false;
        clockConfig.image.x = image["x"] | 0;
        clockConfig.image.y = image["y"] | 0;
        clockConfig.image.width = image["width"] | 64;
        clockConfig.image.height = image["height"] | 64;
      }
      
      // 保存到 Preferences
      preferences.begin("clock", false);
      preferences.putBytes("config", &clockConfig, sizeof(ClockConfig));
      preferences.end();
      
      Serial.println("闹钟配置已更新并保存");
      
      // 如果当前是闹钟模式，立即刷新显示
      if (currentMode == MODE_CLOCK) {
        displayClock();
      }
      
      response["message"] = "clock config updated and saved";
    }
    else if (cmd == "set_image_pixels") {
      // 接收图片像素数据
      JsonArray pixels = doc["pixels"];
      
      if (pixels.size() == 0) {
        response["status"] = "error";
        response["message"] = "no pixels data";
      } else {
        // 释放旧的像素数据
        if (imagePixels != nullptr) {
          free(imagePixels);
          imagePixels = nullptr;
        }
        
        // 分配新的像素数据
        imagePixelCount = pixels.size();
        imagePixels = (PixelData*)malloc(sizeof(PixelData) * imagePixelCount);
        
        if (imagePixels == nullptr) {
          response["status"] = "error";
          response["message"] = "memory allocation failed";
          imagePixelCount = 0;
        } else {
          // 复制像素数据
          for (int i = 0; i < imagePixelCount; i++) {
            JsonObject pixel = pixels[i];
            imagePixels[i].x = pixel["x"];
            imagePixels[i].y = pixel["y"];
            imagePixels[i].r = pixel["r"];
            imagePixels[i].g = pixel["g"];
            imagePixels[i].b = pixel["b"];
            
            // 每100个像素让出CPU
            if (i % 100 == 0) yield();
          }
          
          // 保存像素数据到 Preferences（如果数据不太大）
          preferences.begin("clock", false);
          if (imagePixelCount * sizeof(PixelData) < 500000) { // 限制500KB
            preferences.putBytes("pixels", imagePixels, sizeof(PixelData) * imagePixelCount);
            preferences.putInt("pixelCount", imagePixelCount);
            Serial.printf("像素数据已保存: %d 个像素\n", imagePixelCount);
          } else {
            Serial.println("像素数据太大，无法保存到 Preferences");
          }
          preferences.end();
          
          // 如果当前是闹钟模式，立即刷新显示
          if (currentMode == MODE_CLOCK) {
            displayClock();
          }
          
          response["message"] = "image pixels updated and saved";
          response["count"] = imagePixelCount;
        }
      }
    }
    else if (cmd == "get_pixel_count") {
      // 查询当前保存的像素数量
      response["pixelCount"] = imagePixelCount;
      response["message"] = "current pixel count";
    }
    else if (cmd == "clear") {
      dma_display->clearScreen();
      
      // 如果是画板模式，清空画布缓冲区
      if (currentMode == MODE_CANVAS && canvasInitialized) {
        Serial.println("清空画布缓冲区");
        memset(canvasBuffer, 0, sizeof(canvasBuffer));
      }
      
      response["message"] = "cleared";
    }
    else if (cmd == "brightness") {
      int value = doc["value"];
      if (value >= 0 && value <= 255) {
        currentBrightness = value;
        dma_display->setBrightness8(value);
        response["brightness"] = value;
      } else {
        response["status"] = "error";
        response["message"] = "brightness must be 0-255";
      }
    }
    else if (cmd == "text") {
      String text = doc["text"].as<String>();
      int x = doc["x"] | 0;
      int y = doc["y"] | 0;
      dma_display->clearScreen();
      dma_display->setCursor(x, y);
      dma_display->setTextColor(dma_display->color565(255, 255, 255));
      dma_display->print(text);
      response["message"] = "text displayed";
    }
    else if (cmd == "pixel") {
      int x = doc["x"];
      int y = doc["y"];
      int r = doc["r"] | 255;
      int g = doc["g"] | 255;
      int b = doc["b"] | 255;
      dma_display->drawPixelRGB888(x, y, r, g, b);
      response["message"] = "pixel set";
    }
    else if (cmd == "image") {
      JsonArray pixels = doc["pixels"];
      int width = doc["width"] | PANEL_RES_X;
      int height = doc["height"] | PANEL_RES_Y;
      
      dma_display->clearScreen();
      int idx = 0;
      for (int y = 0; y < height && y < PANEL_RES_Y; y++) {
        for (int x = 0; x < width && x < PANEL_RES_X; x++) {
          if (idx + 2 < pixels.size()) {
            uint8_t r = pixels[idx++];
            uint8_t g = pixels[idx++];
            uint8_t b = pixels[idx++];
            dma_display->drawPixelRGB888(x, y, r, g, b);
          }
        }
        // 每行让出CPU，防止看门狗超时
        if (y % 8 == 0) yield();
      }
      response["message"] = "image displayed";
    }
    else if (cmd == "image_sparse") {
      // 稀疏像素格式：只传输非空像素
      // 不自动清屏，由客户端控制
      JsonArray pixels = doc["pixels"];
      
      for (JsonVariant pixel : pixels) {
        int x = pixel["x"];
        int y = pixel["y"];
        uint8_t r = pixel["r"];
        uint8_t g = pixel["g"];
        uint8_t b = pixel["b"];
        
        if (x >= 0 && x < PANEL_RES_X && y >= 0 && y < PANEL_RES_Y) {
          dma_display->drawPixelRGB888(x, y, r, g, b);
        }
      }
      response["message"] = "sparse pixels drawn";
      response["count"] = pixels.size();
    }
    else if (cmd == "image_chunk") {
      // 分块传输格式
      JsonArray pixels = doc["pixels"];
      int width = doc["width"];
      int offsetX = doc["offsetX"] | 0;
      int offsetY = doc["offsetY"] | 0;
      int height = doc["height"];
      int chunk = doc["chunk"] | 0;
      int total = doc["total"] | 1;
      
      // 第一块时清空屏幕
      if (chunk == 0) {
        dma_display->clearScreen();
      }
      
