cnone616/Glowxel/esp32-firmware/src/main.cpp
  server.on("/clear", HTTP_GET, [](AsyncWebServerRequest *request){
    dma_display->clearScreen();
    request->send(200, "application/json", "{\"status\":\"cleared\"}");
  });
  
  server.on("/brightness", HTTP_POST, [](AsyncWebServerRequest *request){
    if (request->hasParam("value", true)) {
      int brightness = request->getParam("value", true)->value().toInt();
      if (brightness >= 0 && brightness <= 255) {
        currentBrightness = brightness;
        dma_display->setBrightness8(brightness);
        request->send(200, "application/json", "{\"status\":\"ok\",\"brightness\":" + String(brightness) + "}");
      } else {
        request->send(400, "application/json", "{\"error\":\"brightness must be 0-255\"}");
      }
    } else {
      request->send(400, "application/json", "{\"error\":\"missing value parameter\"}");
    }
  });
  
  server.on("/text", HTTP_POST, [](AsyncWebServerRequest *request){
    if (request->hasParam("content", true)) {
      String text = request->getParam("content", true)->value();
      int x = request->hasParam("x", true) ? request->getParam("x", true)->value().toInt() : 0;
      int y = request->hasParam("y", true) ? request->getParam("y", true)->value().toInt() : 0;
      
      dma_display->clearScreen();
      dma_display->setCursor(x, y);
      dma_display->setTextColor(dma_display->color565(255, 255, 255));
      dma_display->print(text);
      
      request->send(200, "application/json", "{\"status\":\"ok\"}");
    } else {
      request->send(400, "application/json", "{\"error\":\"missing content parameter\"}");
    }
  });
  
  server.begin();
  Serial.println("HTTP服务器已启动在端口80");
  Serial.println("等待客户端连接...");
}

void setup() {
  Serial.begin(115200);
  delay(2000);
  
  Serial.println("\n\n=================================");
  Serial.println("ESP32 LED图片显示系统启动...");
  Serial.println("=================================");
  
  Serial.println("1. 初始化LED灯板...");
  setupMatrix();
  
  Serial.println("2. 加载闹钟配置...");
  preferences.begin("clock", true);
  
  // 加载配置
  size_t configSize = preferences.getBytesLength("config");
  Serial.printf("配置大小: %d bytes (期望: %d bytes)\n", configSize, sizeof(ClockConfig));
  
  if (configSize == sizeof(ClockConfig)) {
    preferences.getBytes("config", &clockConfig, sizeof(ClockConfig));
    Serial.println("已加载保存的闹钟配置");
    Serial.printf("  image.show = %d\n", clockConfig.image.show);
  } else {
    Serial.println("使用默认闹钟配置");
  }
  
  // 加载像素数据
  imagePixelCount = preferences.getInt("pixelCount", 0);
  Serial.printf("像素数量: %d\n", imagePixelCount);
  
  if (imagePixelCount > 0) {
    size_t pixelDataSize = preferences.getBytesLength("pixels");
    Serial.printf("像素数据大小: %d bytes (期望: %d bytes)\n", 
      pixelDataSize, sizeof(PixelData) * imagePixelCount);
    
    if (pixelDataSize == sizeof(PixelData) * imagePixelCount) {
      imagePixels = (PixelData*)malloc(pixelDataSize);
      if (imagePixels != nullptr) {
        preferences.getBytes("pixels", imagePixels, pixelDataSize);
        Serial.printf("✓ 已加载保存的像素数据: %d 个像素\n", imagePixelCount);
        
        // 如果有像素数据，自动启用图片显示
        clockConfig.image.show = true;
        Serial.println("✓ 已自动启用图片显示");
      } else {
        Serial.println("✗ 像素数据内存分配失败");
        imagePixelCount = 0;
      }
    } else {
      Serial.println("✗ 像素数据大小不匹配");
      imagePixelCount = 0;
    }
  } else {
    Serial.println("没有保存的像素数据");
  }
  
  preferences.end();
  
  Serial.println("3. 连接WiFi...");
  setupWiFi();
  
  Serial.println("4. 启动HTTP和WebSocket服务器...");
  setupServer();
  
  Serial.println("\n=================================");
  Serial.println("系统就绪！");
  if (config_mode) {
    Serial.print("AP模式访问地址: http://");
    Serial.println(WiFi.softAPIP());
  } else {
    Serial.print("STA模式访问地址: http://");
    Serial.println(WiFi.localIP());
    Serial.println("WebSocket 路径: ws://" + WiFi.localIP().toString() + "/ws");
  }
  Serial.println("=================================\n");
}

void loop() {
  if (config_mode) {
    dnsServer.processNextRequest();
  }

  // 检查是否有待保存的二进制像素数据
  // 如果距离最后一次接收超过500ms，认为接收完成，保存到 Preferences
  if (binaryDataPending && millis() - lastBinaryReceiveTime > 500) {
    binaryDataPending = false;
    
    if (imagePixels != nullptr && imagePixelCount > 0) {
      Serial.printf("=== 开始保存像素数据到 Preferences: %d 个像素 ===\n", imagePixelCount);
      
      preferences.begin("clock", false);
      
      size_t dataSize = imagePixelCount * sizeof(PixelData);
      Serial.printf("数据大小: %d bytes\n", dataSize);
      
      if (dataSize < 500000) { // 限制500KB
        preferences.putBytes("pixels", imagePixels, dataSize);
        preferences.putInt("pixelCount", imagePixelCount);
        
        // 同时保存 clockConfig，确保 image.show 也被保存
        preferences.putBytes("config", &clockConfig, sizeof(ClockConfig));
        
        preferences.end();
        
        Serial.println("✓✓✓ 像素数据已保存到 Preferences ✓✓✓");
        Serial.printf("保存了 %d 个像素，image.show=%d\n", imagePixelCount, clockConfig.image.show);
        
        // 发送确认消息给客户端，告知实际接收的像素数量
        StaticJsonDocument<128> confirmDoc;
        confirmDoc["status"] = "ok";
        confirmDoc["message"] = "pixels_received";
        confirmDoc["count"] = imagePixelCount;
        
        String confirmMsg;
        serializeJson(confirmDoc, confirmMsg);
        ws.textAll(confirmMsg);
        
      } else {
        preferences.end();
        Serial.println("✗✗✗ 像素数据太大，无法保存 ✗✗✗");
      }
      
      // 保存完成后，如果是闹钟模式，刷新显示
      if (currentMode == MODE_CLOCK) {
        displayClock();
      }
    }
  }

  // 在闹钟模式下，每分钟更新一次时钟（而不是每秒）
  if (currentMode == MODE_CLOCK) {
    static unsigned long lastClockUpdate = 0;
    static int lastMinute = -1;
    
    // 获取当前时间
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)) {
      // 只有分钟变化时才刷新
      if (timeinfo.tm_min != lastMinute) {
        lastMinute = timeinfo.tm_min;
        displayClock();
      }
    } else {
      // 如果时间未同步，每10秒尝试刷新一次
      if (millis() - lastClockUpdate > 10000) {
        lastClockUpdate = millis();
        displayClock();
      }
    }
  }

  static unsigned long lastPrint = 0;
  if (millis() - lastPrint > 5000) {
    lastPrint = millis();

    if (config_mode) {
      Serial.println("--- AP模式状态 ---");
      Serial.print("AP IP: ");
      Serial.println(WiFi.softAPIP());
      Serial.print("连接设备数: ");
      Serial.println(WiFi.softAPgetStationNum());
    } else {
      Serial.println("--- STA模式状态 ---");
      Serial.print("WiFi状态: ");
      Serial.println(WiFi.status() == WL_CONNECTED ? "已连接" : "未连接");
      Serial.print("IP: ");
      Serial.println(WiFi.localIP());
      Serial.print("客户端连接: ");
      Serial.println(clientConnected ? "是" : "否");
      if (imagePixelCount > 0) {
        Serial.print("像素数据: ");
        Serial.print(imagePixelCount);
        Serial.println(" 个像素");
      }
    }
  }

  // 清理WebSocket，防止内存泄漏
  ws.cleanupClients();
  
  yield();
}
